Tekla Open API Reference for Tekla Structures 2025
Vector.Multiply Operator (Double, Vector)
 Calculates the multiplication of the given vector with the given scalar.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Vector operator *(
	double Multiplier,
	Vector Vector
)
Public Shared Operator * (
	Multiplier As Double,
	Vector As Vector
) As Vector
Parameters
Multiplier
Type: System.Double
The scalar to multiply the vector with.
Vector
Type: Tekla.Structures.Geometry3d.Vector
The vector to be multiplied.
Return Value
Type: Vector
The new vector that is the multiplication of the vector and the scalar.
See Also
Reference
Vector Class
Multiply Overload
Tekla.Structures.Geometry3d Namespace